=================
component - string content
=================

(component foo []
	"quoted content"
	-- line content
	)

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(string)
			(string))))

=================
document - string content
=================

(document foo []
	"quoted content"
	-- line content
	)

-----------------

(program
	(document_declaration
		(identifier)
		(properties)
		(template
			(string)
			(string))))

=================
element - quoted string content
=================

(component foo []
	(foo "quoted content"))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(string))))))

=================
element - line string content
=================

(component foo []
	(foo
		-- quoted content
	))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(string))))))

=================
component - content - element
=================

(component foo [] (foo))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element (identifier)))))

=================
document - content - element
=================

(document foo [] (foo))

-----------------

(program
	(document_declaration
		(identifier)
		(properties)
		(template
			(element (identifier)))))

=================
element - content - element
=================

(component foo []
	(foo {} (foo)))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(element (identifier)))))))

=================
component - mixed content
=================

(component foo [] "string" (foo))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(string)
			(element (identifier)))))

=================
document - mixed content
=================

(document foo [] "string" (foo))

-----------------

(program
	(document_declaration
		(identifier)
		(properties)
		(template
			(string)
			(element (identifier)))))

=================
element - mixed content
=================

(component foo []
	(foo {} "string" (foo)))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(string)
					(element (identifier)))))))

