======================
comment
======================

; a comment

----------------------

(program (comment))

======================
package declaration
======================

(package p "component/main")

----------------------

(program
	(package_declaration
		name: (identifier)
		path: (string)))

======================
package declaration: invalid name
:error
======================

(package p/a "path/to/package")

----------------------

======================
package declaraton: invalid path
:error
======================

(package p -- path/to/package
)

----------------------

======================
import declaration
======================

(import i "path/to/package")
(import i "path/to/package")

----------------------

(program
	(import_declaration
		name: (identifier)
		path: (string))
	(import_declaration
		name: (identifier)
		path: (string)))

======================
import declaration: invalid name
:error
======================

(import i/a "path/to/package")

----------------------

======================
import declaration: invalid path
:error
======================

(import i -- path/to/package
)

----------------------

======================
using declaration
======================

(import i "path/to/package")
(using s i)
(using [a b] i)
(using [a, b] i)
(using [a,] i)

----------------------

(program
	(import_declaration
		name: (identifier)
		path: (string))
	(using_declaration
		name: (identifier)
		from: (identifier))
	(using_declaration
		name: (identifier)
		name: (identifier)
		from: (identifier))
	(using_declaration
		name: (identifier)
		name: (identifier)
		from: (identifier))
	(using_declaration
		name: (identifier)
		from: (identifier)))

======================
using declaration: invalid name
:error
======================

(import i "path")
(using i/a i)

----------------------

======================
using declaration: invalid name
:error
======================

(import i "path")
(using [i/a] i)

----------------------

======================
using declaration: invalid name (from)
:error
======================

(import i "path")
(using a i/a)

----------------------

======================
component declaration
======================

(component fancy-button [])
(component fancy-button [a: A])
(component fancy-button [a: A, b: B])
(component fancy-button [a: A  b: B])

----------------------

(program
	(component_declaration
		name: (identifier)
		(properties))
	(component_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier))))
	(component_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier))
			(property name: (identifier) type: (identifier))))
	(component_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier))
			(property name: (identifier) type: (identifier)))))

======================
component declaration: invalid name
:error
======================

(component foo/bar [])

----------------------

======================
component declaration: invalid property name
:error
======================

(component foo [a/b A])

----------------------

======================
document declaration: no name
======================

(document [])

----------------------

(program (document_declaration (properties)))

======================
document declaration: empty property list
======================

(document foo [])

----------------------

(program
	(document_declaration name: (identifier) (properties)))

======================
document declaration: property
======================

(document foo [a: A])

----------------------

(program
	(document_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier)))))

======================
document declaration: trailing comma
======================

(document foo [a: A,])

----------------------

(program
	(document_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier)))))

======================
document declaration: comma separator
======================

(document foo [a: A, b: B])

----------------------

(program
	(document_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier))
			(property name: (identifier) type: (identifier)))))

======================
document declaration: no comma b/w properties
======================

(document foo [a: A  b: B])

----------------------

(program
	(document_declaration
		name: (identifier)
		(properties
			(property name: (identifier) type: (identifier))
			(property name: (identifier) type: (identifier)))))

======================
document declaration: invalid name
:error
======================

(document foo/bar [])

----------------------

======================
document declaration: invalid property name
:error
======================

(document foo [a/b A])

----------------------

======================
document and component declaration order
======================

(component baz [])
(document [])
(component bar [])
(component foo [])

----------------------

(program
	(component_declaration (identifier) (properties))
    (document_declaration (properties))
	(component_declaration (identifier) (properties))
	(component_declaration (identifier) (properties)))

======================
enum declaration
======================

(enum E [one, two])

----------------------

(program
	(enum_declaration
		name: (identifier)
		(enum_constants
			constant: (identifier)
			constant: (identifier))))


======================
enum declaration - optional semi-colon
======================

(enum E [one two])

----------------------

(program
	(enum_declaration
		name: (identifier)
		(enum_constants
			constant: (identifier)
			constant: (identifier))))

======================
document declaration: one per file
:error
:skip
======================

(document [])
(document [])

----------------------
