=================
element
=================

(component foo []
	(foo)
	(foo { k: "v", })
	(foo { k: "v", a: "b" })
	(foo { k: "v"  a: "b" }))
-----------------

(program
	(component_declaration
		name: (identifier)
		(properties)
		(template
			(element tag: (identifier))
			
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
						value: (string)))))
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
							value: (string))
						(attribute
							key: (identifier)
							value: (string)))))
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
							value: (string))
					(attribute
							key: (identifier)
							value: (string))))))))

=================
element - attribute directive
=================

(component foo []
	(foo #a{}))

-----------------

(program
	(component_declaration
		name: (identifier)
		(properties)
		(template
			(element
				tag: (identifier)
				(children
					(attributes
						directive: (identifier)))))))

=================
element - multiple attributes
=================

(component foo []
	(foo {} {}))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(attributes))))))

=================
element - mixed attribute and content
=================

(component foo []
	(foo {}
		"foo"
		{}
		(foo)))

-----------------

(program
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(string)
					(attributes)
					(element (identifier)))))))
