=================
element
=================

(component foo []
	(foo)
	(a/foo {})
	(foo { k: "v", })
	(foo { k: "v", a: "b" })
	(foo { k: "v"  a: "b" }))
-----------------

(source_file
	(component_declaration
		name: (identifier)
		(properties)
		(template
			(element tag: (identifier))
			(element
				tag: (member_access
					object: (identifier)
					member: (identifier))
				(children
					(attributes)))
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
						value: (string)))))
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
							value: (string))
						(attribute
							key: (identifier)
							value: (string)))))
			(element
				tag: (identifier)
				(children
					(attributes
						(attribute
							key: (identifier)
							value: (string))
					(attribute
							key: (identifier)
							value: (string))))))))

=================
element - attribute directive
=================

(component foo []
	(foo #a{})
	(foo #a/b{})
	(foo #a/b/c{}))

-----------------

(source_file
	(component_declaration
		name: (identifier)
		(properties)
		(template
			(element
				tag: (identifier)
				(children
					(attributes
						directive: (identifier))))
			(element
				tag: (identifier)
				(children
					(attributes
						directive: (member_access
							object: (identifier)
							member: (identifier)))))
			(element
				tag: (identifier)
				(children
					(attributes
						directive: (member_access
							object: (member_access
								object: (identifier)
								member: (identifier))
							member: (identifier))))))))

=================
element - multiple attributes
=================

(component foo []
	(foo {} {}))

-----------------

(source_file
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(attributes))))))

=================
element - mixed attribute and content
=================

(component foo []
	(foo {}
		"foo"
		{}
		(foo)))

-----------------

(source_file
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(children
					(attributes)
					(string)
					(attributes)
					(element (identifier)))))))
