===================
expression - bool
===================

(component foo []
	(foo {a: true}))

-------------------

(source_file
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(attributes
					(attribute
						(identifier)
						(bool)))))))

===================
expression - string
===================

(component foo []
	(foo {a: "foo"}))

-------------------

(source_file
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(attributes
					(attribute
						(identifier)
						(string)))))))


===================
expression - number
===================

(component foo []
	(foo {a: 0
	  	  b: 10}))

-------------------

(source_file
	(component_declaration
		(identifier)
		(properties)
		(template
			(element
				(identifier)
				(attributes
					(attribute
						(identifier)
						(number))
					(attribute
						(identifier)
						(number)))))))

===================
expression - identifier
===================

(component foo []
	(foo {a: A}))

-------------------

(source_file
	(component_declaration
		name: (identifier)
		(properties)
		(template
			(element
			tag: (identifier)
			(attributes
				(attribute
					key: (identifier)
					value: (identifier)))))))

