===================
expression - bool
===================

(foo {a: true})

-------------------

(source_file
	(element
		(identifier)
		(attributes
			(attribute
				(identifier)
				(bool)))))

===================
expression - string
===================

(foo {a: "foo"})

-------------------

(source_file
	(element
		(identifier)
		(attributes
			(attribute
				(identifier)
				(string)))))

===================
expression - number
===================

(foo {a: 0
	  b: 10})

-------------------

(source_file
	(element
		(identifier)
		(attributes
			(attribute
				(identifier)
				(number))
			(attribute
				(identifier)
				(number)))))

===================
expression - operator
===================

(foo {a: (> a "")})

-------------------

(source_file
	(element
		(identifier)
		(attributes
			(attribute
				(identifier)
				(call
					(operator)
					(identifier)
					(string))))))
